/*
    1*. Создать окно для клиентской части чата: большое текстовое поле для отображения переписки в центре окна. Однострочное текстовое поле для ввода сообщений и кнопка для отсылки сообщений на нижней панели. Сообщение должно отсылаться либо по нажатию кнопки на форме, либо по нажатию кнопки Enter. При «отсылке» сообщение перекидывается из нижнего поля в центральное.

    2. Напишите метод, который возвращает индекс первого вхождения данного целого числа в списке.
        Предположим, что индекс первого элемента в списке равен нулю.
        Если числа не существует в списке, верните -1.
        public int search(Integer n, Integer[] list)

    3 Напишите метод, переворачивающий строку.
        Например, «java interview» превращается в «weivretni avaj».
        public String reverse(String s)

    4 Напишите метод, который возвращает наибольшее целое число в списке.
        public Integer maximum(Integer[] list)

    5. Напишите метод, который возвращает среднее значение из списка целых чисел.
        public Double average(List<Integer> list)

    6. Имея список строк, напишите метод, который возвращает список всех строк, которые начинаются с буквы «а» (нижний регистр) и имеют ровно 3 буквы.
        public List<String> search(List<String> list)

        Все пункты кроме первого должны быть реализовано с помощью лямбда выражений
* */

package Lesson_4;


public class StarLesson_4 {

    public static void main(String[] args) {
        MyChat myChat = new MyChat();

    }

}
